import React from 'react'

function WholeSummary() {
  return (
    <div className='p-8'>
      <div>
       <p className="  ml-96 text-[16px] text-gray-500 ">00:00-05:00</p>

      </div>
        
        
        <div className="flex justify-center items-center  bg-gray-100">
      <div className="max-w-4xl w-full p-6 bg-primary10 rounded-lg shadow-md ">
      
        <p className="text-lg text-gray-700 leading-relaxed">
        បច្ចេកវិទ្យាព័ត៌មាន (IT) គឺជាសំណុំនៃវិស័យពាក់ព័ន្ធនៅក្នុងបច្ចេកវិទ្យាព័ត៌មាន និងទំនាក់ទំនង (ICT) ដែលរួមបញ្ចូលប្រព័ន្ធកុំព្យូទ័រ កម្មវិធី 
ភាសាសរសេរកម្មវិធី ដំណើរការទិន្នន័យ និងព័ត៌មាន និងការផ្ទុក។[1] បច្ចេកវិទ្យាព័ត៌មាន គឺជាកម្មវិធីវិទ្យាសាស្ត្រកុំព្យូទ័រ និងវិស្វកម្មកុំព្យូទ័រ។

ពាក្យនេះត្រូវបានគេប្រើជាទូទៅជាសទិសន័យសម្រាប់កុំព្យូទ័រ និងបណ្តាញកុំព្យូទ័រ ប៉ុន្តែវាក៏រួមបញ្ចូលនូវបច្ចេកវិទ្យាចែកចាយព័ត៌មានផ្សេងទៀត
ផងដែរ ដូចជាទូរទស្សន៍ និងទូរស័ព្ទ។ ផលិតផល ឬសេវាកម្មជាច្រើននៅក្នុងសេដ្ឋកិច្ចមួយត្រូវបានផ្សារភ្ជាប់ជាមួយនឹងបច្ចេកវិទ្យាព័ត៌មាន រួមទាំង
ផ្នែករឹងកុំព្យូទ័រ កម្មវិធី អេឡិចត្រូនិក គ្រឿងអេឡិចត្រូនិក អ៊ីនធឺណិត ឧបករណ៍ទូរគមនាគមន៍ និងពាណិជ្ជកម្មអេឡិចត្រូនិក។[2][a]

ប្រព័ន្ធបច្ចេកវិទ្យាព័ត៌មាន (ប្រព័ន្ធអាយធី) ជាទូទៅគឺជាប្រព័ន្ធព័ត៌មាន ប្រព័ន្ធទំនាក់ទំនង ឬនិយាយឱ្យកាន់តែច្បាស់ជាងនេះទៅទៀត ប្រព័ន្ធកុំព្យូទ័រ
 — រួមទាំងផ្នែករឹង សូហ្វវែរ និងឧបករណ៍គ្រឿងកុំព្យូទ័រទាំងអស់ — ដំណើរការដោយក្រុមអ្នកប្រើប្រាស់ព័ត៌មានវិទ្យាដែលមានកម្រិត ហើយគម្រោង 
IT ជាធម្មតាសំដៅទៅលើការចាត់តាំង និងការអនុវត្តប្រព័ន្ធ IT ។[4] ប្រព័ន្ធ IT ដើរតួនាទីយ៉ាងសំខាន់ក្នុងការសម្របសម្រួលការគ្រប់គ្រងទិន្នន័យ
ប្រកបដោយប្រសិទ្ធភាព ពង្រឹងបណ្តាញទំនាក់ទំនង និងគាំទ្រដល់ដំណើរការរៀបចំនៅទូទាំងឧស្សាហកម្មផ្សេងៗ។ 

កុំព្យូទ័រអេឡិចត្រូនិច ដោយប្រើឧបករណ៍បញ្ជូនត ឬវ៉ាល់ បានចាប់ផ្តើមលេចឡើងនៅដើមទសវត្សរ៍ឆ្នាំ 1940 ។ ម៉ាស៊ីនអេឡិចត្រូនិច Zuse Z3 បាន
បញ្ចប់នៅឆ្នាំ 1941 គឺជាកុំព្យូទ័រដែលអាចសរសេរកម្មវិធីបានដំបូងគេរបស់ពិភពលោក និងតាមស្តង់ដារទំនើបមួយក្នុងចំណោមម៉ាស៊ីនដំបូងគេដែលអាច
ចាត់ទុកថាជាម៉ាស៊ីនកុំព្យូទ័រពេញលេញ។ ក្នុងកំឡុងសង្គ្រាមលោកលើកទីពីរ Colossus បានបង្កើតកុំព្យូទ័រឌីជីថលអេឡិចត្រូនិចដំបូងគេដើម្បីឌិគ្រីប
សាររបស់អាល្លឺម៉ង់។ ទោះបីជាវាអាចសរសេរកម្មវិធីបានក៏ដោយ វាមិនមែនជាគោលបំណងទូទៅទេ ដែលត្រូវបានរចនាឡើងដើម្បីអនុវត្តការងារតែមួយ
ប៉ុណ្ណោះ។ វាក៏ខ្វះសមត្ថភាពក្នុងការរក្សាទុកកម្មវិធីរបស់វានៅក្នុងអង្គចងចាំផងដែរ។ ការសរសេរកម្មវិធីត្រូវបានអនុវត្តដោយប្រើដោត និងកុងតាក់ដើម្បី
ផ្លាស់ប្តូរខ្សែភ្លើងខាងក្នុង។[13] កុំព្យូទ័រដែលផ្ទុកនូវកម្មវិធីឌីជីថលទំនើបដំបូងគេដែលទទួលស្គាល់បានគឺ Manchester Baby ដែលដំណើរការកម្មវិធី
ដំបូងរបស់ខ្លួននៅថ្ងៃទី 21 ខែមិថុនា ឆ្នាំ 1948។[14]
          
        </p>
        
        
      </div>
    </div>
    </div>
  )
}

export default WholeSummary